Tekla Open API Reference for Tekla Structures 2025
CustomPartBase Properties
The CustomPartBase type exposes the following members.
Properties
Name | Description
Identifier
 The identifier of the executable plug-in instance.
Positions
 The positional attributes for a custom part instance.
Top
See Also
Reference
CustomPartBase Class
Tekla.Structures.Plugins Namespace